In [1]:
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
df = pd.read_csv(url, sep = '\t')
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [3]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [4]:
#Which was the most ordered item? and How many items were ordered
item = df.groupby('item_name').sum()
item.head()

                       order_id  quantity
item_name
6 Pack Soft Drink         52322        55
Barbacoa Bowl             53972        66
Barbacoa Burrito          74718        91
Barbacoa Crispy Tacos      5613        12
Barbacoa Salad Bowl        9708        10

In [5]:
maxim =item['quantity'].max()
max_qty = item[item['quantity']==maxim]
max_qty

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [6]:
#What was the most ordered item in the choice_description column?

In [7]:
item = df.groupby('choice_description').sum()
item.head()

                                                    order_id  quantity
choice_description
[Adobo-Marinated and Grilled Chicken, Pinto Bea...       214         1
[Adobo-Marinated and Grilled Chicken, [Sour Cre...       279         1
[Adobo-Marinated and Grilled Chicken]                    217         1
[Adobo-Marinated and Grilled Steak, [Sour Cream...       279         1
[Adobo-Marinated and Grilled Steak]                      217         1

In [8]:
maxim =item['quantity'].max()
max_qty = item[item['quantity']==maxim]
max_qty

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

In [9]:
#Turn the item price into a float

In [10]:
h=list(df['item_price'])
k= list(map(lambda x: x.strip("$ "),h))
k = pd.Series(k)
df['item_price'] = k.astype(float)
print(df['item_price'].dtype)
df.head()

float64

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [ ]:
#How much was the revenue for the period in the dataset?

In [17]:
revenue = (df['quantity'] * df['item_price']).sum()
print('Total revenue generated = ${}'.format(revenue))

Total revenue generated = $39237.02

In [ ]:
#print a data frame with only two columns item_name and item_price

In [18]:
df[['item_name','item_price']]

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4617                          Steak Burrito       11.75
4618                          Steak Burrito       11.75
4619                     Chicken Salad Bowl       11.25
4620                     Chicken Salad Bowl        8.75
4621                     Chicken Salad Bowl        8.75

[4622 rows x 2 columns]

In [19]:
# delete the duplicates in item_name and quantity
filtered = df.drop_duplicates(['item_name','quantity'])

In [23]:
# select only the products with quantity equals to 1
one_prod = filtered[filtered.quantity == 1]

# select only the item_name and item_price columns
price_per_item = one_prod[['item_name', 'item_price']]

# sort the values from the most to less expensive
sorted_items=price_per_item.sort_values(by = "item_price", ascending = False)
sorted_items.head()

                  item_name  item_price
606        Steak Salad Bowl       11.89
1229    Barbacoa Salad Bowl       11.89
1132    Carnitas Salad Bowl       11.89
7             Steak Burrito       11.75
168   Barbacoa Crispy Tacos       11.75

In [28]:
veg_sal = df[df['item_name']=="Veggie Salad Bowl"]
print('Veggie Salad Bowl was ordered {} times'.format(veg_sal.shape[0]))

Veggie Salad Bowl was ordered 18 times

In [ ]:
Veggie Salad Bowl"]